# Database Admin 101 - Lab

## Introduction 

In this lab you'll go through the process of designing and creating a database. From there, you'll also begin to populate this table with mock data provided to you.

## Objectives

You will be able to:

* Create a SQL database
* Create a SQL table
* Create rows in a SQL table
* Alter entries in a SQL table
* Delete entries in a SQL table
* Commit changes via sqlite3

## The Scenario

You are looking to design a database for a school which will house various information from student grades to contact information, class roster lists and attendance. First, think of how you would design such a database and record some of your ideas below.

# Your Answer Here

Record some information here about how you would design such a database. What table would you include? What columns would each table have? What would be the primary means to join said tables?

## Creating the Database

Now that you've put a little thought into how you might design your database, it's time to go ahead and create it! Start by import the necessary packages. Then, create a database called **school.sqlite**.

In [1]:
import sqlite3
conn = sqlite3.connect('school.sqlite')
c = conn.cursor()

In [ ]:
#Your code here; create the database school.sqlite

## Create a Table for Contact Information

Create a table called contactInfo to house contact information for both students and staff. Be sure to include columns for first name, last name, role (student/staff), email, telephone number, street, city, state and zipcode. Be sure to also create a primary key for the table.

In [8]:
c.execute('''create table contact_info2 ( id integer primary key,
                                            first_name text,
                                            last_name text,
                                            role text,
                                            tel_num integer,
                                            address text,
                                            city text,
                                            state text,
                                            zipcode integer)

''')

## Populate the Table

Below, code is provided for you in order to load a list of dictionaries. Briefly examine the list. Each dictionary in the list will serve as an entry for your contact info table. Once you've briefly investigated the structure of this data, write a for loop to iterate through the list and create an entry in your table for each person's contact info.

In [4]:
import pickle

with open('contact_list.pickle', 'rb') as f:
    contacts = pickle.load(f)

In [9]:
for contact in contacts:
    c.execute('''insert into contact_info2 (first_name, last_name, role, 
    tel_num, address, city, state, zipcode) values
    ('{}','{}','{}','{}','{}','{}','{}','{}');
    '''.format(contact['firstName'], contact['lastName'], contact['role'], contact['telephone '],
              contact['street'], contact['city'], contact['state'], contact['zipcode ']))

In [12]:
import pandas as pd

In [14]:
df = pd.DataFrame(c.execute('''select * from contact_info2''').fetchall())
df

,0,1,2,3,4,5,6,7,8
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,5,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
5,6,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
6,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
7,8,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

In [ ]:
#Your code here

## Commit Your Changes to the Database

Persist your changes by committing them to the database.

In [15]:
conn.commit()

## Create a Table for Student Grades

Create a new table in the database called "grades". In the table, include the following fields: userId, courseId, grade.

** This problem is a bit more tricky and will require a dual key. (A nuance you have yet to see.)
Here's how to do that:

```SQL
CREATE TABLE table_name(
   column_1 INTEGER NOT NULL,
   column_2 INTEGER NOT NULL,
   ...
   PRIMARY KEY(column_1,column_2,...)
);
```

In [16]:
c.execute('''create table grades (userid integer not null,
                                    courseid integer not null,
                                    grade integer, primary key(userid, courseid))''')

## Remove Duplicate Entries

An analyst just realized that there is a duplicate entry in the contactInfo table! Find and remove it.

In [24]:
c.execute("""select first_name, last_name, tel_num,
                      count(*) from contact_info2
                      group by 1,2,3
                      having count(*) > 1;""").fetchall()

[('Jane', 'Evans', 3259909290, 2)]

In [26]:
c.execute('''DELETE FROM contact_info2 WHERE tel_num = 3259909290;''')

In [27]:
df = pd.DataFrame(c.execute('''select * from contact_info2''').fetchall())
df

,0,1,2,3,4,5,6,7,8
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
5,8,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

## Updating an Address

Ed Lyman just moved to 2910 Simpson Avenue York, PA 17403. Update his address accordingly.

In [28]:
c.execute('''update contact_info2 set address = "2910 Simpson Avenue" where id = 8;''')
c.execute('''update contact_info2 set city = "York" where id = 8;''')
c.execute('''update contact_info2 set state = "PA" where id = 8;''')
c.execute('''update contact_info2 set zipcode = 17403 where id = 8;''')
df = pd.DataFrame(c.execute('''select * from contact_info2''').fetchall())
df

,0,1,2,3,4,5,6,7,8
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
5,8,Ed,Lyman,student,5179695576,2910 Simpson Avenue,York,PA,17403

## Commit Your Changes to the Database

Once again, persist your changes by committing them to the database.

In [ ]:
#Your code here

## Summary

While there's certainly more to do with setting up and managing this database, you certainly got a taste for creating, populating and maintaining databases! Feel free to continue fleshing out this exercise to continue practicing.